<a href="https://colab.research.google.com/github/al00pes/engenharia_de_dados/blob/main/Exercicios_aula_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Banco de Dados - Prof. Sérgio Lifschitz

---

## Exercícios da Aula 3: Continuação com a linguagem SQL DML (consultas)


---


ANTES de começar,  ❗ **não esquecer** ❗ de, antes de mais nada, SALVAR este notebook no ambiente COLAB no drive da tua própria conta GOOGLE.

## PASSO 1: Instalação e Configuração do PostgreSQL

Basta dar PLAY que o script abaixo instalará o SGBD PostgreSQL

In [1]:
# %%capture
# Instalação do PostgreSQL
!sudo apt-get -y -qq update
!pip install sqlalchemy==2.0
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start
# Alterando a senha do usuário padrão 'postgres' para 'postgres'
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

Collecting sqlalchemy==2.0
  Downloading SQLAlchemy-2.0.0-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (2.7 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.7/2.7 MB 21.9 MB/s eta 0:00:00
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (4.7.1)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (2.0.2)
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.20
    Uninstalling SQLAlchemy-2.0.20:
      Successfully uninstalled SQLAlchemy-2.0.20
Successfully installed sqlalchemy-2.0.0
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78, <> line 13.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package logrotate.
(Reading database ... 120831 files and directories currently installed.)
Preparing to unpack .../00-logrotate_3.19.0-1ubuntu1.1_amd64.deb ...
Unpacking logrotate (3.19.0-1ubuntu1.1) ...
Selecting previously unselected package netbase.
Preparing to unpack .../01-netbase_6.3_all.deb ...
Unpacking netbase (6.3) ...
Selecting previously unselected package libcommon-sense-perl:amd64.
Preparing to unpack .../02-libcommon-sense-perl_3.75-2build1_amd64.deb ...
Unpacking libcommon-sense-perl:amd64 (3.75-2build1) ...
Selecting previously unselected package libjson-perl.
Preparing to unpack .../03-libjson-perl_4.04000-1_all.deb ...
Unpacking libjson-perl (4.04000-1) ...
Selecting previously unselected package libtypes-serialiser-perl.
Preparing to unpack .../04-libtypes-serialiser-perl_1.01-1_all.deb ...
Unpacking libtypes-serialiser-perl (1.01-1) ...
Selecting previously unselected package libjson-xs-perl.
Preparing to unpack .../05-libjson-xs-perl_4.030-1build3_amd64.deb ...
Unpacking libjson-xs-perl (4.030-1build3) ...
Selecting previously unselected package postgresql-client-common.
Preparing to unpack .../06-postgresql-client-common_238_all.deb ...
Unpacking postgresql-client-common (238) ...
Selecting previously unselected package postgresql-client-14.
Preparing to unpack .../07-postgresql-client-14_14.9-0ubuntu0.22.04.1_amd64.deb ...
Unpacking postgresql-client-14 (14.9-0ubuntu0.22.04.1) ...
Selecting previously unselected package ssl-cert.
Preparing to unpack .../08-ssl-cert_1.1.2_all.deb ...
Unpacking ssl-cert (1.1.2) ...
Selecting previously unselected package postgresql-common.
Preparing to unpack .../09-postgresql-common_238_all.deb ...
Adding 'diversion of /usr/bin/pg_config to /usr/bin/pg_config.libpq-dev by postgresql-common'
Unpacking postgresql-common (238) ...
Selecting previously unselected package postgresql-14.
Preparing to unpack .../10-postgresql-14_14.9-0ubuntu0.22.04.1_amd64.deb ...
Unpacking postgresql-14 (14.9-0ubuntu0.22.04.1) ...
Selecting previously unselected package postgresql.
Preparing to unpack .../11-postgresql_14+238_all.deb ...
Unpacking postgresql (14+238) ...
Selecting previously unselected package sysstat.
Preparing to unpack .../12-sysstat_12.5.2-2ubuntu0.2_amd64.deb ...
Unpacking sysstat (12.5.2-2ubuntu0.2) ...
Setting up logrotate (3.19.0-1ubuntu1.1) ...
Created symlink /etc/systemd/system/timers.target.wants/logrotate.timer → /lib/systemd/system/logrotate.timer.
Setting up libcommon-sense-perl:amd64 (3.75-2build1) ...
Setting up ssl-cert (1.1.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Setting up libtypes-serialiser-perl (1.01-1) ...
Setting up libjson-perl (4.04000-1) ...
Setting up netbase (6.3) ...
Setting up sysstat (12.5.2-2ubuntu0.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline

Creating config file /etc/default/sysstat with new version
update-alternatives: using /usr/bin/sar.sysstat to provide /usr/bin/sar (sar) in auto mode
Created symlink /etc/systemd/system/sysstat.service.wants/sysstat-collect.timer → /lib/systemd/system/sysstat-collect.timer.
Created symlink /etc/systemd/system/sysstat.service.wants/sysstat-summary.timer → /lib/systemd/system/sysstat-summary.timer.
Created symlink /etc/systemd/system/multi-user.target.wants/sysstat.service → /lib/systemd/system/sysstat.service.
Setting up postgresql-client-common (238) ...
Setting up libjson-xs-perl (4.030-1build3) ...
Setting up postgresql-client-14 (14.9-0ubuntu0.22.04.1) ...
update-alternatives: using /usr/share/postgresql/14/man/man1/psql.1.gz to provide /usr/share/man/man1/psql.1.gz (psql.1.gz) in auto mode
Setting up postgresql-common (238) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Adding user postgres to group ssl-cert

Creating config file /etc/postgresql-common/createcluster.conf with new version
Building PostgreSQL dictionaries from installed myspell/hunspell packages...
Removing obsolete dictionary files:
Created symlink /etc/systemd/system/multi-user.target.wants/postgresql.service → /lib/systemd/system/postgresql.service.
Setting up postgresql-14 (14.9-0ubuntu0.22.04.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Creating new PostgreSQL cluster 14/main ...
/usr/lib/postgresql/14/bin/initdb -D /var/lib/postgresql/14/main --auth-local peer --auth-host scram-sha-256 --no-instructions
The files belonging to this database system will be owned by user "postgres".
This user must also own the server process.

The database cluster will be initialized with locale "en_US.UTF-8".
The default database encoding has accordingly been set to "UTF8".
The default text search configuration will be set to "english".

Data page checksums are disabled.

fixing permissions on existing directory /var/lib/postgresql/14/main ... ok
creating subdirectories ... ok
selecting dynamic shared memory implementation ... posix
selecting default max_connections ... 100
selecting default shared_buffers ... 128MB
selecting default time zone ... Etc/UTC
creating configuration files ... ok
running bootstrap script ... ok
performing post-bootstrap initialization ... ok
syncing data to disk ... ok
update-alternatives: using /usr/share/postgresql/14/man/man1/postmaster.1.gz to provide /usr/share/man/man1/postmaster.1.gz (postmaster.1.gz) in auto mode
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql (14+238) ...
Processing triggers for man-db (2.10.2-1) ...
 * Starting PostgreSQL 14 database server
   ...done.
ALTER ROLE

## PASSO 2: Preparo do Esquema Relacional EMPRESA

Baixe o esquema e instância de teste do BD EMPRESA neste link: https://drive.google.com/file/d/1zFlLaVJIWZokadeKWICYrWhTW_I2o_Bj/view?usp=sharing

❗Coloque o arquivo baixado *.SQL na **pasta padrão do seu Google Drive** ❗

Em seguida, é só dar PLAY (nas duas células seguintes!) pois os scripts (programas) abaixo preparam o ambiente para realizar consultas SQL no esquema de BD EMPRESA no seu próprio COLAB.

In [2]:
# [2.1] Monta o diretório do Google Drive no seu Colab
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
# [2.2] Cria o esquema no banco de dados EMPRESA no Colab
%%capture
!sudo -u postgres psql -U postgres -c 'DROP SCHEMA IF EXISTS empresa CASCADE;'
!sudo -u postgres psql -U postgres -c 'CREATE SCHEMA empresa;'
!PGPASSWORD='postgres' psql -h localhost -U postgres -d postgres -a -f /content/esquema_empresa.sql

## PASSO 3: Preparando para usar o SGBD PostgreSQL localmente

Mais uma vez, é só dar PLAY (nas duas células seguintes!)

In [4]:
# Configurando o PostgreSQL na variável de ambiente DATABASE_URL
%env DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

env: DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

In [5]:
# Carregando a extensão sql para usar o SQL pelo Google Colab
%load_ext sql

## **Lista de Exercícios**

Prática de SQL sobre o esquema EMPRESA implantado no SGBD PostgreSQL, já considerando a sintaxe completa após as 3 aulas do módulo "Banco de Dados"

### Esquema relacional da **base de dados Empresa**:

Seja o esquema relacional da base de dados simplificada de uma EMPRESA genérica. As chaves primárias (PK) respectivas estão sublinhadas e as chaves estrangeiras em itálico

<img src='https://drive.google.com/uc?id=1JWCG8paO9ksU-22L79Qmnkb4iYAHnlOy'>

A empresa é organizada em departamentos, cada qual tendo um nome, um número de identificação e um empregado (gerente) responsável pelo mesmo. Guarda-se como informação a data a partir da qual o empregado assumiu a gerência do departamento. Um departamento pode estar presente em diversas localidades do país.

Um departamento controla um certo número de projetos, e cada projeto tem um nome, um número de identificação e uma localidade única. Os departamentos têm vários empregados, para os quais guarda-se os respectivos nomes, número de identificação (Ident) na empresa, endereço (End) residencial, sexo, data de nascimento e salário (sal) em reais. Todo empregado tem um empregado que é seu superior hierárquico (supervisor direto - SuperIdent) dentro do departamento, informação que também deve ser mantida no banco de dados.

Um empregado é alocado a um único departamento mas pode trabalhar em mais de um projeto, estes não necessariamente controlados pelo departamento ao qual ele pertence. Controla-se o total de horas semanais (HRS) em que um empregado trabalha em cada projeto.

Para fim de controle de seguro de saúde de cada empregado, deve-se manter informações dos nomes, sexo, data de nascimento e grau de parentesco de seus dependentes. Estes são identificados por seu nome mas, também, pela identidade do empregado do qual dependem.

As restrições de integridade referenciais são: o atributo SuperIdent é chave estrangeira (FK) referenciando a PK da própria tabela EMPREGADO, da mesma forma que IdentGer em DEPARTAMENTO e IdentEmp em TRABALHA_NO e DEPENDENTE. DepNum é FK para a PK Num em DEPARTAMENTO em 3 tabelas: Empregado, Projeto e DepLoc. Por fim, ProjNum é FK em TRABALHA_NO referenciando a PK Num em PROJETO.

**ATENÇÃO:** deve-se dar play na próxima célula sempre que for usar o esquema EMPRESA!

In [6]:
# Ativando o esquema empresa
%%sql
SET SCHEMA 'empresa';

Done.

[]

**Consulta exemplo:** Quais empregados trabalham no Departamento de Informática?

In [40]:
# Para rodar a consulta em SQL abaixo, basta dar PLAY nesta célula!

# Se quiser, pode mudar o departamento e verificar as respostas
# (instâncias!) distintas. Para isso consultar quais departamentos
# existem na tabela Departamento desta instância exemplo.

# Atenção ao uso de acentos, maiúsculas e minúsculas: para SQL e para atributos
# das relações não faz diferença. Entretando, para valores sim! Se tivesse usado
# "informática" com acento ou tudo minúsculo teria retornado uma tabela vazia.

%%sql

SELECT ident as IDENTIDADE, nome as NOME_EMPREGADO
FROM   empregado
WHERE  depnum in (SELECT num
                  FROM departamento
                  WHERE nome = 'Informatica')

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(Decimal('8'), 'José Carlos         '),
 (Decimal('11'), 'Silvano Silva       '),
 (Decimal('14'), 'Bruno Peixoto       '),
 (Decimal('20'), 'Raphael Mendes      '),
 (Decimal('26'), 'Luana Marques       ')]

### 1. Listar todos os Números dos projetos e os respectivos Números de departamentos que os controlam.

In [8]:
%%sql

SELECT num as projeto, depnum as controle_depart
FROM projeto ;

 * postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

[(Decimal('10'), Decimal('4')),
 (Decimal('30'), Decimal('4')),
 (Decimal('20'), Decimal('1')),
 (Decimal('0'), Decimal('2')),
 (Decimal('40'), Decimal('13')),
 (Decimal('50'), Decimal('13')),
 (Decimal('60'), Decimal('15')),
 (Decimal('70'), Decimal('11')),
 (Decimal('80'), Decimal('15')),
 (Decimal('90'), Decimal('3')),
 (Decimal('100'), Decimal('8'))]

### 2 Listar todos os Números e Nomes dos projetos, e os respectivos Números e Nomes de departamentos que os controlam.

In [9]:
%%sql

SELECT projeto.num as N_Projeto , projeto.nome as nome_projeto, departamento.num as n_depart, departamento.nome as nome_departamento
FROM projeto
JOIN departamento
on projeto.depnum = departamento.num
ORDER BY projeto.num;

 * postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

[(Decimal('0'), 'Excursão       ', Decimal('2'), 'Historia                 '),
 (Decimal('10'), 'Informatizacao ', Decimal('4'), 'Economia                 '),
 (Decimal('20'), 'Pagamentos     ', Decimal('1'), 'Financeiro               '),
 (Decimal('30'), 'Reengenharia   ', Decimal('4'), 'Economia                 '),
 (Decimal('40'), 'Genoma         ', Decimal('13'), 'BioInformatica           '),
 (Decimal('50'), 'Big Data       ', Decimal('13'), 'BioInformatica           '),
 (Decimal('60'), 'Reagindo       ', Decimal('15'), 'Nanotecnologia           '),
 (Decimal('70'), 'Câmeras        ', Decimal('11'), 'Segurança                '),
 (Decimal('80'), 'NanoParticulas ', Decimal('15'), 'Nanotecnologia           '),
 (Decimal('90'), 'CorreçãoBugs   ', Decimal('3'), 'Informatica              '),
 (Decimal('100'), 'Vacinação      ', Decimal('8'), 'Farmacia                 ')]

### 3. Exibir o nome e grau de parentesco dos dependentes juntamente com a identidade e nome dos empregados dos quais dependem.

In [10]:
%%sql

SELECT depend.nome as NOME, depend.parentesco as PARENTESCO, emp.ident as N_empregado, emp.nome as Nome_empregado
FROM dependente AS depend
JOIN empregado as emp
on depend.identemp = emp.ident
ORDER BY depend.identemp;

 * postgresql://postgres:***@localhost:5432/postgres
24 rows affected.

[('Maria               ', 'FILHA     ', Decimal('1'), 'Joao                '),
 ('João                ', 'IRMÃO     ', Decimal('1'), 'Joao                '),
 ('José                ', 'PAI       ', Decimal('1'), 'Joao                '),
 ('Carlos              ', 'PAI       ', Decimal('2'), 'Maria               '),
 ('Claudio             ', 'IRMÃO     ', Decimal('2'), 'Maria               '),
 ('Lurdes              ', 'FILHA     ', Decimal('4'), 'Ciclano             '),
 ('Lurdinalva          ', 'IRMÃ      ', Decimal('4'), 'Ciclano             '),
 ('Luan Santana        ', 'PAI       ', Decimal('4'), 'Ciclano             '),
 ('Elba Ramalho        ', 'MÃE       ', Decimal('6'), 'Luciano Mauri       '),
 ('Preta Gil           ', 'IRMÃ      ', Decimal('6'), 'Luciano Mauri       '),
 ('Fafa de Belem       ', 'MÃE       ', Decimal('8'), 'José Carlos         '),
 ('Gustavo Lima        ', 'FILHO     ', Decimal('9'), 'Maria José          '),
 ('Thaeme              ', 'IRMÃ      ', Decimal('13'), 'Jorge Sousa         '),
 ('Thiago              ', 'FILHO     ', Decimal('13'), 'Jorge Sousa         '),
 ('Maria Cecilia       ', 'PRIMA     ', Decimal('15'), 'Bruna Carla         '),
 ('Rodolfo             ', 'PAI       ', Decimal('15'), 'Bruna Carla         '),
 ('Antônio             ', 'PAI       ', Decimal('16'), 'Bianca Lourenco     '),
 ('Lucas               ', 'FILHO     ', Decimal('17'), 'Felicidade Maria    '),
 ('Tadeu               ', 'AVÔ       ', Decimal('17'), 'Felicidade Maria    '),
 ('Agueda              ', 'PRIMA     ', Decimal('17'), 'Felicidade Maria    '),
 ('Luzia               ', 'FILHA     ', Decimal('20'), 'Raphael Mendes      '),
 ('Ines                ', 'FILHA     ', Decimal('21'), 'Raphaela Fontoura   '),
 ('Anastacia           ', 'MÃE       ', Decimal('23'), 'Paola Silva         '),
 ('Rita                ', 'AVÓ       ', Decimal('23'), 'Paola Silva         ')]

### 4. Para cada empregado, mostrar seu nome e sexo, e a identidade e nome do seu superior imediato.

In [11]:
%%sql

SELECT emp.nome , emp.sexo , emp.ident as n_identificacao, emp.superident as superior_direto,
FROM empregado as emp
JOIN empregado as dep
ON dep.sup = emp.ident;

 * postgresql://postgres:***@localhost:5432/postgres
(psycopg2.errors.SyntaxError) syntax error at or near "FROM"
LINE 2: FROM empregado as emp
        ^

[SQL: SELECT emp.nome , emp.sexo , emp.ident as n_identificacao, emp.superident as superior_direto,
FROM empregado as emp
JOIN empregado as dep
ON dep.sup = emp.ident;]
(Background on this error at: https://sqlalche.me/e/20/f405)

### 5. Listar os diferentes valores de salários pagos aos empregados da empresa.

In [12]:
%%sql

SELECT DISTINCT sal as Salarios
FROM empregado ;

 * postgresql://postgres:***@localhost:5432/postgres
15 rows affected.

[(Decimal('12335.00'),),
 (Decimal('2000.00'),),
 (Decimal('30001.00'),),
 (Decimal('2.00'),),
 (Decimal('23265.00'),),
 (Decimal('5878.00'),),
 (Decimal('6554.00'),),
 (Decimal('1245.00'),),
 (Decimal('5222.00'),),
 (Decimal('10000.00'),),
 (Decimal('1000.00'),),
 (Decimal('22233.00'),),
 (Decimal('11255.00'),),
 (Decimal('5598.00'),),
 (Decimal('7500.00'),)]

### 6. Quais os nomes dos empregados que trabalham menos de 20 horas por semana em algum projeto?

In [13]:
%%sql

SELECT DISTINCT nome
FROM empregado
JOIN Trabalhano
ON ident = identemp
WHERE hrs < 20 ;

 * postgresql://postgres:***@localhost:5432/postgres
27 rows affected.

[('Luciano Mauri       ',),
 ('Paola Silva         ',),
 ('Raphaela Fontoura   ',),
 ('Joao                ',),
 ('Luciana Fernandes   ',),
 ('Maria               ',),
 ('Ariane Goncalves    ',),
 ('Bruna Carla         ',),
 ('Severino Buarque    ',),
 ('Ciclano             ',),
 ('Luana Marques       ',),
 ('Laura Benayon       ',),
 ('Caetano Veloso      ',),
 ('Raphael Mendes      ',),
 ('Johnny Depp         ',),
 ('Felicidade Maria    ',),
 ('Jorge Sousa         ',),
 ('Marcos Guedes       ',),
 ('Natasha Gasparelli  ',),
 ('José Carlos         ',),
 ('Leandro Silva       ',),
 ('Bianca Lourenco     ',),
 ('João Maria          ',),
 ('Bruno Peixoto       ',),
 ('Simone Estoggliato  ',),
 ('Silvano Silva       ',),
 ('Maria José          ',)]

### 7. Apresentar os nomes de todos os empregados que não têm dependentes.

In [14]:
%%sql

SELECT nome
FROM empregado
WHERE ident not in ( SELECT identemp
                  FROM dependente )

 * postgresql://postgres:***@localhost:5432/postgres
14 rows affected.

[('Silvano Silva       ',),
 ('Bruno Peixoto       ',),
 ('Luciana Fernandes   ',),
 ('Marcos Guedes       ',),
 ('Natasha Gasparelli  ',),
 ('Luana Marques       ',),
 ('Simone Estoggliato  ',),
 ('Ariane Goncalves    ',),
 ('Leandro Silva       ',),
 ('João Maria          ',),
 ('Severino Buarque    ',),
 ('Laura Benayon       ',),
 ('Caetano Veloso      ',),
 ('Johnny Depp         ',)]

### 8. Quais empregados tem cargos de chefia, isto é, não têm superior imediato?

In [15]:
%%sql

SELECT nome
FROM empregado
WHERE superident IS NULL;

 * postgresql://postgres:***@localhost:5432/postgres
9 rows affected.

[('Maria               ',),
 ('José Carlos         ',),
 ('Raphael Mendes      ',),
 ('Natasha Gasparelli  ',),
 ('Simone Estoggliato  ',),
 ('Raphaela Fontoura   ',),
 ('Severino Buarque    ',),
 ('Caetano Veloso      ',),
 ('Joao                ',)]

### 9. Listar todos os locais onde se encontram departamentos da empresa ou onde são realizados projetos.

In [16]:
%%sql

SELECT DISTINCT d.local
FROM deploc as d
JOIN departamento as de
ON depnum = num;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('Salvador       ',),
 ('Porto Alegre   ',),
 ('Belo Horizonte ',),
 ('Florianopolis  ',),
 ('Vitoria        ',),
 ('Queimadas      ',),
 ('Cabo Frio      ',),
 ('Natal          ',),
 ('Rio de Janeiro ',),
 ('São Paulo      ',)]

### 10. Apresentar o resultado dos salários dos empregados que trabalham no projeto “Reengenharia” caso fosse dado um aumento de 10%.

In [43]:
%%sql

SELECT e.nome, e.sal, 1.1 * sal as novo_sal , p.nome
FROM empregado as e
JOIN projeto as p
ON e.depnum = p.depnum
WHERE p.nome = 'Reengenharia';

 * postgresql://postgres:***@localhost:5432/postgres
4 rows affected.

[('Ciclano             ', Decimal('1000.00'), Decimal('1100.000'), 'Reengenharia   '),
 ('Luciana Fernandes   ', Decimal('1245.00'), Decimal('1369.500'), 'Reengenharia   '),
 ('Marcos Guedes       ', Decimal('23265.00'), Decimal('25591.500'), 'Reengenharia   '),
 ('Simone Estoggliato  ', Decimal('2.00'), Decimal('2.200'), 'Reengenharia   ')]

### 11. Quais os nomes dos empregados e os números de departamento dos quais eles são gerentes, se o forem?

In [42]:
%%sql

SELECT e.nome ,d.num as se_for_gerente
FROM empregado as e
RIGHT OUTER JOIN departamento as d
ON  d.identger = e.ident;

 * postgresql://postgres:***@localhost:5432/postgres
17 rows affected.

[('Maria               ', Decimal('3')),
 ('Paola Silva         ', Decimal('1')),
 ('Caetano Veloso      ', Decimal('5')),
 ('João Maria          ', Decimal('6')),
 ('Maria José          ', Decimal('7')),
 ('Bruna Carla         ', Decimal('9')),
 ('Joao                ', Decimal('11')),
 ('Joao                ', Decimal('15')),
 ('Johnny Depp         ', Decimal('8')),
 ('Ariane Goncalves    ', Decimal('10')),
 ('Maria               ', Decimal('4')),
 ('Leandro Silva       ', Decimal('13')),
 ('Raphaela Fontoura   ', Decimal('14')),
 ('Jorge Sousa         ', Decimal('2')),
 ('Luciano Mauri       ', Decimal('12')),
 ('Maria               ', Decimal('28319')),
 ('Severino Buarque    ', Decimal('9000'))]

### 12. Listar os nomes dos empregados, assim como os departamentos onde trabalham, que ganham mais do que qualquer empregado do departamento de nome *Pesquisa*

In [19]:
%%sql

SELECT e.nome, d.nome as departamento
FROM empregado as e
JOIN departamento as d
ON d.num = e.depnum
AND e.sal > ALL
            (SELECT sal
            FROM empregado as e
            JOIN departamento as d
            on d.num = e.depnum
            AND
            d.nome = 'Pesquisa');

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('Silvano Silva       ', 'Informatica              '),
 ('Bianca Lourenco     ', 'Historia                 '),
 ('Raphael Mendes      ', 'Informatica              '),
 ('Marcos Guedes       ', 'Economia                 '),
 ('Natasha Gasparelli  ', 'Historia                 '),
 ('Ariane Goncalves    ', 'Matematica               '),
 ('Luciano Mauri       ', 'Nanotecnologia           '),
 ('Johnny Depp         ', 'Farmacia                 ')]

### 13. Listar os nomes dos empregados que trabalham o mesmo total de horas em algum projeto em que o empregado Caetano Veloso trabalha

In [20]:
%%sql

SELECT DISTINCT e.nome, t.hrs
FROM empregado as e
JOIN trabalhano as t
ON e.ident = t.identemp
WHERE t.hrs = 2;

 * postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

[('Ariane Goncalves    ', Decimal('2')),
 ('Bruna Carla         ', Decimal('2')),
 ('Caetano Veloso      ', Decimal('2')),
 ('Felicidade Maria    ', Decimal('2')),
 ('João Maria          ', Decimal('2')),
 ('José Carlos         ', Decimal('2')),
 ('Leandro Silva       ', Decimal('2')),
 ('Luciana Fernandes   ', Decimal('2')),
 ('Luciano Mauri       ', Decimal('2')),
 ('Maria José          ', Decimal('2')),
 ('Severino Buarque    ', Decimal('2'))]

### 14. Quais empregados ganham o maior salário? Listar identidade, nome e salário.

In [21]:
%%sql

SELECT nome,ident, sal as maior_salario
FROM empregado
WHERE sal in ( Select max(sal)
              FROM empregado);

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('Johnny Depp         ', Decimal('10'), Decimal('30001.00'))]